In [1]:
import pandas as pd

In [2]:
titanic_df = pd.read_csv("titanic-data.csv")

In [4]:
titanic_df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

## Conditional based filtering ##

In [5]:
titanic_df["Fare"] >100

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Fare, Length: 891, dtype: bool

In [6]:
mask =titanic_df["Fare"] >100
fare_100= titanic_df[mask]
fare_100.shape

(53, 12)

In [10]:
female_df=titanic_df[titanic_df.Sex== 'female']

In [11]:
female_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [18]:
fare_100_female=fare_100[fare_100.Sex== 'female']

In [19]:
fare_100_female.shape

(34, 12)

In [20]:
fare_100_male=fare_100[fare_100.Sex== 'male']

In [21]:
fare_100_male.shape

(19, 12)

In [22]:
fare_100_female.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
195,196,1,1,"Lurette, Miss. Elise",female,58.0,0,0,PC 17569,146.5208,B80,C
215,216,1,1,"Newell, Miss. Madeleine",female,31.0,1,0,35273,113.2750,D36,C
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C

## how many female were survive ##

In [32]:
survive_female= titanic_df[
(titanic_df['Sex']=='female') & (titanic_df['Survived']==1)

]

In [33]:
survive_female.shape

(233, 12)

In [25]:
len(survive)

233

In [29]:
(233+100) /891

0.37373737373737376

## how many male were survive ##

In [27]:
survive_male= titanic_df[
(titanic_df['Sex']=='male') & (titanic_df['Survived']==1)

]

In [30]:
survive_male.shape

(109, 12)

In [39]:
survived_1 = titanic_df[
(titanic_df["Pclass"] == 3) & (titanic_df["Survived"] ==1)
]
survived_1.shape

(119, 12)

Check Survival rate in 1st Class Ticket

In [50]:
survive_1stclass = titanic_df[
    (titanic_df["Pclass"] == 1) & (titanic_df["Survived"] == 1)
]
survive_1stclass.shape

(136, 12)

## filtering ##

In [43]:
titanic_df[titanic_df["Cabin"].notna()].shape

(204, 12)

In [46]:
titanic_df[titanic_df.duplicated()].shape

(0, 12)

In [47]:
titanic_df[~titanic_df.duplicated()].shape

(891, 12)

In [49]:
titanic_df[titanic_df["Cabin"].isnull()].shape

(687, 12)